---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussMissingReference
source: html/097f724b-d8dc-70c6-b1fd-16f7be5904b9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TrussMissingReference Property

Trusses require both a top and a bottom chord reference (chain of one or more reference lines).

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussMissingReference { get; }
```